<?php
{
  $text="Привет Сидоровы!";
  echo $text."<br>";
}

{
    $text1="Привет ";
    $text2="Шапаренко!";
    echo $text1.$text2."<br>";
}

{
    $name="Григоровичей";
    echo "Привет от ".$name. "!"."<br>";
}

{
    $age=41;
    echo "Мне ".$age."год"."<br>";
    echo "я инженеришка :))"."<br>";
}

{
    $arr1=["Коля"=>"1000$" , "Валера"=>"800$"];
    echo $arr1["Валера"]."<br>";
}

{
    $arr2=["a,","b","c","d"];
    var_dump($arr2)."<br>";
}

{
    $arr3=["Привет " , "Валера", "!"];
    echo $arr3[0].$arr3[1].$arr3[2]."<br>";
}

{
    $arr4=["Привет " , "Валера", "!"];
    echo $arr3[0]."<br>";
    echo $arr3[1]."<br>";
    echo $arr3[2]."<br>";
}

{
    $person = array( "Бендер Остап Ибрагимович",
        "Корейко Александр Иванович",
        "Козлевич Адам Казимирович",
        "Паниковский Михаил Самуэлевич" );
    echo "<table border='3'>\n";
    foreach($person as $index => $val)
    {
        echo "<tr><td>".$index."</td><td>".$val."</td></tr>\n";
    }
    echo "</table>\n";
}

{
    echo "<ul>\n";
   $person = array( "Бендер Остап Ибрагимович",
       "Корейко Александр Иванович",
       "Козлевич Адам Казимирович",
       "Паниковский Михаил Самуэлевич" );
   foreach($person as $val)
   {
       echo "<li>".$val."</li>\n";
   }
   echo "</ul>\n";
}


?>
